back-end/app/commands/authenticate_user.rb

  def user
    user = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "maro96leon"], ["LIMIT", 1]]