back-end/app/commands/authorize_api_request.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def user
      @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token