back-end/app/controllers/api/events_controller.rb

    def post_event
        @event = @current_user.events.create(event_params)
---
INSERT INTO "events" ("id", "event_name", "event_category", "event_place", "event_address", "event_initial_date", "event_final_date", "event_type", "thumbnail", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def delete_event
        @event = @current_user.events.find(params[:id])
        if @event
            @event.delete
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 9], ["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]

    def get_event

        @event = @current_user.events.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 9], ["id", 2], ["LIMIT", 1]]

    def get_events
        @event = @current_user.events.order(:timestamps)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? ORDER BY "timestamps" ASC  [["user_id", 9]]