back-end/app/controllers/api/user_controller.rb

INSERT INTO "users" ("id", "username", "email", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def signup
        @user = User.new(user_params)
        if @user.save